{
    "aboutMe": {
        "introduction": ["Hey, I'm Riley. I'm a Software Developer and a Designer. I like to build stuff with JavaScript and React.js. I also like to design and make stuff using Photoshop, Figma, Clip Studio, and Procreate. I've also done other cool stuff like animation and music production in my past work. Some of the things I do for fun are photography, baking, playing video games, and if the weather is nice hiking.",
        "I've graduated with an Associates degree Web Design, and more recently graduated from a coding bootcamp called Flatiron School with a certificate in Software Engineering. However a lot of what I know now I taught myself, or taught by teachers on Udemy and YouTube. Learning is a daily effort of mine, and is something I look forward to keeping up in my future.",
        "Currently I'm building a web application that gives people the best solution for storing and organizing their cooking and baking recipes. I also am open to freelance development and design work. I'm always open to new opportunities, so if you're interested in hiring me or want to know more about me feel free to reach out and we can talk."],
        "education": [
            {
                "name": "Certificate: Software Engineering",
                "school": "Flatiron School",
                "description": "Full Stack Software Engineering Program. Learned JavaScript, React.js, Ruby, Ruby on Rails, SQL, ORMs, and Active Record.",
                "year": "2021"
            },
            {
                "name": "AA, Multimeidia & Interactive Technology: Web Design",
                "school": "Skagit Valley College",
                "description": "Studied fundamentals in web design and search engine optimisation. Learned essential technologies such as the Adobe Creative Suite, WordPress, jQuery, HTML5, CSS, and Bootstrap.",
                "year": "2018"
            }
        ]
    },
    "development": {
        "about": [
            "Most of my software development skills come from my time at a coding bootcamp called Flatiron School. There I was able to collaborate with my peers and build valuable soft skills in communication, teamwork, and problem solving. I've taken extra steps outside of traditional education to expand my technical developer skills as well, in order to make advances in projects and in my career. This adaptability is what makes me stand out as a developer, allowing me to be confident in any situation and project that I’m being put in."            
        ],
        "skills": {
            "skills": ["Front End Development", "Back End Development", "Web Development", "Web Design"],
            "languages": ["JavaScript", "Ruby", "PostgreSQL", "SASS/SCSS", "HTML", "Python"],
            "tools": ["React.js", "Redux.js", "Ruby on Rails", "Git", "Bootstrap", "jQuery" ]
        },
        "projects": [
            {
                "name": "GoodBread",
                "about": "GoodBread is recipe web application that aims to be the home for your recipes that your friends and family send you, and for the many recipes that fill up your bookmarks bar in your web browser. The goal is to make your recipes easy to organize, find, and share. Currently there are folders and tags to help organize recipes, as well as a dynamic recipe form to help write new recipes.",
                "media": "gb1.png",
                "subSections": [
                    {
                        "name": "Frontend",
                        "about": "The front end of this project was built using React.js, and Redux for state management. API requests and data loading are managed by using a unique mix of Axios as well as React-Query. This allows for a systematic approach to request data while leaving the front end in a loading state before receiving data from the API. The front end was styled using SASS, and uses CSS flex throughout the styling to give responsiveness and to make the styling process easier.",
                        "link": "https://github.com/Rmiverson/goodbread"
                    },
                    {
                        "name": "Backend",
                        "about": "The back end for GoodBread was built using a Ruby on Rails REST API which uses a PostgreSQL database to store to. The api serializes data to JSON, and is set up to handle pagination for large data requests. The API also utilizes JWT to authenticate API requests from each user, and user data is encrypted using Bcrypt.",
                        "link": "https://github.com/Rmiverson/goodbread-api"
                    }
                ]
            }
        ]
    },
    "design": {
        "introduction": ["I began designing when I was taking courses at my local college. There I learned basic design fundamentals like color theory, composition, layout, and much more. I studied primarily in web design, however I also studied other areas like photography and art. After my education I’ve been growing my own personal style and improving my skills to develop better designs. Currently I’m taking freelance work in graphic design and expanding my skills and experience to grow as a designer."],
        "skills": {
            "skills": ["Graphic Design", "Web Design", "Illustration", "Animation"],
            "software": ["Adobe Photoshop", "Adobe Illustrator", "Adobe InDesign", "Figma", "Blender", "Moho", "Clip Studio Paint", "Procreate", "Inkscape"]
        },
        "projects": [
            {
                "name": "Poisoned Graphic",
                "about": "A graphic I designed for t-shirts and prints. Much of the inspiration for this design came from Pokemon and comic art. The process of making this piece gave me a lot of lessons in color, shape, and perspective.",
                "media": "Poisoned Tee.png"
            },
            {
                "name": "Sadgikarp Graphic",
                "about": "A design I made for t-shirts and prints. Originally the graphic was an art piece from my graphic design classes in college. This is another graphic heavily inspired by Pokemon. The design  focuses on a motif of a ‘Magikarp’ unhappy with its position in life.",
                "media": "Sadgikarp Print.png"
            },
            {
                "name": "GoodBread Logo",
                "about": "This is a logo design for my web app that I’m working on called GoodBread. The design process started on paper to find the right feel that would represent my app, then it was created using Adobe Illustrator. It focuses on the style of the type and shape of the backing bread to represent my app’s brand. ",
                "media": "GoodBread Logo Old.png"
            },
            {
                "name": "Jerry's Business Card",
                "about": "This was a commission by a client who needed some business cards for his boat detailing company. The design was prototyped using Adobe InDesign and then finalized after getting approval by the client. The client was very satisfied with the result, and gave me valuable experience working freelance.",
                "media": "Jerrys Business card.png"
            },
            {
                "name": "Rmiportfolio Design",
                "about": "This is the prototype landing page for my portfolio design. I primarily used figma for this, and I focused on a simple and straightforward design to make for a modern look. The purpose for redesigning my portfolio was to make my work history stand out, as well as be an example of my skills as a developer and a web designer.",
                "media": "rmiportfolio.png"
            },
            {
                "name": "Dino Graphic",
                "about": "This is currently a work in progress graphic for selling as stickers and other media on an online store. The graphic was sketched in procreate and is being finalized in clip studio paint. The purpose for this graphic is to be a start for growing my character design skills while also putting my work out there to the public.",
                "media": "DinoLines.png"
            }
        ]
    },
    "photography": {
        "about": "I started photography in my time at college, taking a course that taught the basics of taking professional and creative photos. I quickly fell in love with photography because it challenged me to think creatively while also being aware of the technical aspects of the camera. I’ve worked as an official photographer for conference events, as well as a photo retoucher for a family run photo studio. Right now I’m taking photos as a hobby, growing my skills and training my eyes to become a better photographer. ",
        "skills": ["Landscape Photography", "Portrait Photography", "Night Photography", "Event Photography", "Photo Retouching"],
        "software": ["Adobe Photoshop", "Adobe Lightroom", "Skylum Luminar", "Photolynx"],
        "media": ["ph-1.jpg", "ph-2.jpg", "ph-3.jpg", "ph-4.jpg", "ph-5.jpg", "ph-6.jpg", "ph-7.jpg", "ph-8.jpg", "ph-9.jpg", "ph-10.jpg"]
    },
    "contact": {
        "about": "If you’re interested in seeing more of my work or if you’re interested in hiring me, please feel free to reach out. I’m currently looking for software development and design work, as well as commissions. You can reach me on any one of my social media profiles, or through my email. "
    }
}